Repository: 1823616178/uwpsshtool
Catalog: src/SshTool.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# Conflict_Title_MergeConflict
source: These fields changed on both sides
zh_cn: 以下字段两边都改了

# Conflict_Description_InitialImport
source: This is your first sync on this device, but the cloud already has a copy. Choose which to keep.
zh_cn: 这是你首次在本机启用同步，但云端已有一份配置。请选择保留哪一份。

# Conflict_Description_RemoteDeletion
source: The cloud version deleted some items that still exist locally. Confirm to apply.
zh_cn: 云端版本中删除了部分在本机仍存在的项目，请确认后应用。

# Conflict_Description_MergeConflict
source: Local and cloud both edited the same fields. Choose which side to keep.
zh_cn: 本机与云端修改了同一实段的字段，请决定保留哪一侧。

# Conflict_Button_UseRemote
source: Use cloud settings
zh_cn: 使用云端配置

# Conflict_Button_KeepLocal
source: Keep local settings
zh_cn: 保留本机配置

# Conflict_Button_ApplyDeletion
source: Apply deletions
zh_cn: 应用删除

# Conflict_RemoteSummary
source: Cloud: {0} servers · {1} tunnels · {2} groups
zh_cn: 云端：{0} 台主机 · {1} 条隧道 · {2} 分组

# Conflict_IncludesPasswords
source: includes synced passwords
zh_cn: 含已同步密码

# Conflict_IncludesPrivateKeys
source: includes synced private keys
zh_cn: 含已同步私钥

# Conflict_ResolveFailed
source: Could not resolve the conflict, please try again
zh_cn: 解决冲突失败，请稍后重试

# SecurityRotate_Header.Title
source: Security Rotation
zh_cn: 安全清理

# SecurityRotate_Working
source: Generating new key (a few seconds)…
zh_cn: 正在生成新密钥（约数秒）…

# SecurityRotate_Failed
source: Action failed, please try again
zh_cn: 操作失败，请稍后重试

# ChangeLogin_Header.Title
source: Change Login Password
zh_cn: 修改登录密码

# ChangeLogin_Section_Password.Header
source: Change Password
zh_cn: 修改密码

# ChangeLogin_Submit
source: Change password
zh_cn: 修改密码

# ChangeLogin_TooShort
source: New password must be at least 10 characters.
zh_cn: 新密码至少 10 位

# ChangeLogin_Failed
source: Could not change password, please try again
zh_cn: 修改密码失败，请稍后重试

# DeleteAccount_Header.Title
source: Delete Account
zh_cn: 注销账号

# DeleteAccount_Section_Confirm.Header
source: Confirm Deletion
zh_cn: 确认注销

# DeleteAccount_Submit
source: Delete account
zh_cn: 注销账号

# DeleteAccount_Failed
source: Could not delete account, please try again
zh_cn: 注销账号失败，请稍后重试

# DeleteVault_Header.Title
source: Delete Cloud Vault
zh_cn: 删除云端保险库

# DeleteVault_Section_Confirm.Header
source: Confirm Deletion
zh_cn: 确认删除

# DeleteVault_Submit
source: Delete cloud vault
zh_cn: 删除云端保险库

# DeleteVault_Failed
source: Could not delete vault, please try again
zh_cn: 删除保险库失败，请稍后重试

# Tunnels_Title.Text
source: Port Forwarding
zh_cn: 端口转发

source: Stop All
zh_cn: 全部停止

source: Add Tunnel
zh_cn: 添加隧道

# Tunnels_EmptyState.Title
source: No Tunnels
zh_cn: 暂无隧道

# Tunnels_EmptyState.Description
source: Set up local, remote, or SOCKS5 forwarding rules in the background
zh_cn: 在手机后台建立本地、远程或 SOCKS5 转发规则

# Tunnels_EmptyState.PrimaryText
source: Add Tunnel
zh_cn: 添加隧道

# Tunnels_MenuStart
source: Start
zh_cn: 启动

# Tunnels_MenuStop
source: Stop
zh_cn: 停止

# Tunnels_DeleteConfirmTitle
source: Delete Tunnel
zh_cn: 删除隧道

# Tunnels_DeleteConfirmMessage
source: Are you sure you want to delete tunnel "{0}"? This action cannot be undone.
zh_cn: 确定要删除隧道“{0}”吗？此操作无法撤销。

# Tunnels_Delete
source: Delete
zh_cn: 删除

# Tunnels_Cancel
source: Cancel
zh_cn: 取消

# Tunnels_Continue
source: Continue
zh_cn: 继续开启

# Tunnels_LoopbackNoticeTitle
source: Loopback Isolation Notice
zh_cn: 回环隔离限制

# Tunnels_LoopbackNoticeMessage
source: UWP applications have network isolation restrictions: other apps on this device may not be able to connect directly to forwarded ports on 127.0.0.1.
zh_cn: UWP 应用具有网络隔离机制：本机其他应用可能无法直接访问 127.0.0.1 上的转发端口。

# Tunnels_DoNotRemind.Content
source: Do not ask again
zh_cn: 不再提示

# TunnelRow_Switch.[using:Windows.UI.Xaml.Automation]AutomationProperties.Name
source: Toggle Tunnel
zh_cn: 启停隧道

# TunnelRow_MenuToggle.Text
source: Toggle
zh_cn: 启停

# TunnelRow_MenuEdit.Text
source: Edit
zh_cn: 编辑

# TunnelRow_MenuDelete.Text
source: Delete
zh_cn: 删除

# TunnelState_Running
source: Running
zh_cn: 运行中

# TunnelState_Connecting
source: Connecting
zh_cn: 连接中

# TunnelState_Reconnecting
source: Reconnecting
zh_cn: 重连中

# TunnelState_Error
source: Error
zh_cn: 错误

# TunnelState_Idle
source: Stopped
zh_cn: 已停止

# TunnelState_DesktopOnly
source: Desktop only
zh_cn: 仅桌面端运行

# TunnelState_Connections
source: {0} conns
zh_cn: {0} 连接

# Tunnel_Default_Local
source: Local
zh_cn: 本地

# Tunnel_Default_Remote
source: Remote
zh_cn: 远程

# Tunnel_Default_Relay
source: Relay
zh_cn: 中转

# Tunnel_Default_Forward
source: Forward
zh_cn: 转发

# TunnelEdit_Title_New
source: New Tunnel
zh_cn: 新建隧道

# TunnelEdit_Title_Edit
source: Edit Tunnel
zh_cn: 编辑隧道

# TunnelEdit_Section_Basic.Header
source: Basic Configuration
zh_cn: 基础配置

# TunnelEdit_NameBox.Header
source: Name
zh_cn: 名称

# TunnelEdit_TypeBox.Header
source: Tunnel Type
zh_cn: 转发类型

# TunnelEdit_ServerBox.Header
source: SSH Host *
zh_cn: SSH 主机 *

# TunnelEdit_GroupBox.Header
source: Group
zh_cn: 分组

# TunnelEdit_NoGroup
source: No Group
zh_cn: 未分组

# TunnelType_Local
source: Local Forward (Local)
zh_cn: 本地转发 (Local)

# TunnelType_Remote
source: Remote Forward (Remote)
zh_cn: 远程转发 (Remote)

# TunnelType_Dynamic
source: Dynamic SOCKS5 (Dynamic)
zh_cn: 动态 SOCKS5 (Dynamic)

# TunnelType_Relay
source: Relay Forward (Relay)
zh_cn: 中转转发 (Relay)

# TunnelEdit_Section_Route.Header
source: Route and Ports
zh_cn: 路由与端口

# TunnelEdit_ListenHostBox.Header
source: Listen Host
zh_cn: 监听地址

# TunnelEdit_ListenPortBox.Header
source: Listen Port *
zh_cn: 监听端口 *

# TunnelEdit_DestHostBox.Header
source: Destination Host *
zh_cn: 目标主机 *

# TunnelEdit_DestPortBox.Header
source: Destination Port *
zh_cn: 目标端口 *

# TunnelEdit_DestServerBox.Header
source: Destination Server *
zh_cn: 目标服务器 *

# TunnelEdit_RoutePreviewTitle.Text
source: Route Preview
zh_cn: 路径预览

# TunnelEdit_Section_Options.Header
source: Options
zh_cn: 运行选项

# TunnelEdit_AutoReconnectSwitch.Header
source: Auto Reconnect
zh_cn: 自动重连

# TunnelEdit_AutoStartSwitch.Header
source: Start with App
zh_cn: 随应用启动

# TunnelEdit_EnabledSwitch.Header
source: Enabled
zh_cn: 已启用

# TunnelEdit_LocalOnly.Text
source: (Local only)
zh_cn: （仅本机）

# TunnelEdit_Save
source: Save
zh_cn: 保存

# TunnelEdit_Delete
source: Delete Tunnel
zh_cn: 删除隧道

# TunnelEdit_Cancel
source: Cancel
zh_cn: 取消

# TunnelEdit_UnsavedChanges_Title
source: Discard Changes?
zh_cn: 放弃修改？

# TunnelEdit_UnsavedChanges_Message
source: Unsaved changes will be lost.
zh_cn: 未保存的修改将丢失。

# TunnelEdit_Discard
source: Discard
zh_cn: 放弃

# TunnelEdit_DeleteConfirmMessage
source: Are you sure you want to delete this tunnel? This action cannot be undone.
zh_cn: 确定要删除该隧道吗？此操作无法撤销。

# ColorSwatchPicker_TextBlock2.Text
source: Old
zh_cn: 旧

# ColorSwatchPicker_TextBlock1.Text
source: New
zh_cn: 新

# SessionOverlay_CancelButton.Content
source: Cancel
zh_cn: 取消

# SessionOverlay_ReconnectNowButton.Content
source: Reconnect now
zh_cn: 立即重连

# SessionOverlay_StopButton.Content
source: Stop
zh_cn: 停止

# SessionOverlay_RetryButton.Content
source: Retry
zh_cn: 重试

# SessionOverlay_EditButton.Content
source: Edit host
zh_cn: 编辑主机

# SessionOverlay_CloseButton.Content
source: Close
zh_cn: 关闭

# SessionsPane_Button1.Content
source: New session
zh_cn: 新会话

# SnippetPickerFlyout_SearchBox.PlaceholderText
source: Search snippets
zh_cn: 搜索片段

# SnippetPickerFlyout_Empty.Title
source: No snippets
zh_cn: 没有片段

# SnippetPickerFlyout_Empty.Description
source: Add your common commands on the Snippets page first.
zh_cn: 先去「片段」页添加常用命令。

# AgentUnlockDialog_ContentDialog1.Title
source: Choose a key to unlock
zh_cn: 选择解锁密钥

# AgentUnlockDialog_ContentDialog1.PrimaryButtonText
source: Unlock
zh_cn: 解锁

# AgentUnlockDialog_ContentDialog1.SecondaryButtonText
source: Cancel
zh_cn: 取消

# CredentialDialog_ContentDialog1.Title
source: Authentication
zh_cn: 身份验证

# CredentialDialog_ContentDialog1.PrimaryButtonText
source: Connect
zh_cn: 连接

# CredentialDialog_ContentDialog1.SecondaryButtonText
source: Cancel
zh_cn: 取消

# CredentialDialog_RememberBox.Content
source: Save on this device
zh_cn: 保存在本机

# HostKeyDialog_ContentDialog1.Title
source: Confirm host key
zh_cn: 主机密钥确认

# HostKeyDialog_ContentDialog1.PrimaryButtonText
source: Trust and connect
zh_cn: 信任并连接

# HostKeyDialog_ContentDialog1.SecondaryButtonText
source: Cancel
zh_cn: 取消

# HostKeyMismatchDialog_ContentDialog4.Title
source: Host key has changed
zh_cn: 主机密钥已改变

# HostKeyMismatchDialog_ContentDialog4.PrimaryButtonText
source: Cancel
zh_cn: 取消

# HostKeyMismatchDialog_ContentDialog4.SecondaryButtonText
source: Remove the old record and retry…
zh_cn: 移除旧记录并重试…

# HostKeyMismatchDialog_TextBlock3.Text
source: The host key has changed. This may indicate a man-in-the-middle attack.
zh_cn: 主机密钥已改变，可能存在中间人攻击。

# HostKeyMismatchDialog_TextBlock2.Text
source: Recorded fingerprint
zh_cn: 已记录指纹

# HostKeyMismatchDialog_TextBlock1.Text
source: Current fingerprint
zh_cn: 当前指纹

# KbdInteractiveDialog_ContentDialog1.Title
source: Keyboard-interactive authentication
zh_cn: 键盘交互认证

# KbdInteractiveDialog_ContentDialog1.PrimaryButtonText
source: Submit
zh_cn: 提交

# KbdInteractiveDialog_ContentDialog1.SecondaryButtonText
source: Cancel
zh_cn: 取消

# KeyGenerateDialog_ContentDialog1.Title
source: Generate key
zh_cn: 生成密钥

# KeyGenerateDialog_ContentDialog1.PrimaryButtonText
source: Generate
zh_cn: 生成

# KeyGenerateDialog_ContentDialog1.SecondaryButtonText
source: Cancel
zh_cn: 取消

# KeyGenerateDialog_TypeBox.Header
source: Type
zh_cn: 类型

# KeyGenerateDialog_NameBox.Header
source: Name
zh_cn: 名称

# KeyGenerateDialog_CommentBox.Header
source: Comment
zh_cn: 注释

# KeyImportDialog_ContentDialog1.Title
source: Import key
zh_cn: 导入密钥

# KeyImportDialog_ContentDialog1.PrimaryButtonText
source: Continue
zh_cn: 继续

# KeyImportDialog_ContentDialog1.SecondaryButtonText
source: Cancel
zh_cn: 取消

# KeyImportDialog_PickFileButton.Content
source: Import from file…
zh_cn: 从文件导入…

# KeyImportDialog_PassphraseBox.Header
source: Passphrase
zh_cn: 短语

# KeyImportDialog_RememberBox.Content
source: Remember passphrase
zh_cn: 保存短语

# KeyImportDialog_NameBox.Header
source: Name
zh_cn: 名称

# PassphraseDialog_ContentDialog1.Title
source: Private key passphrase
zh_cn: 私钥短语

# PassphraseDialog_ContentDialog1.PrimaryButtonText
source: Unlock
zh_cn: 解锁

# PassphraseDialog_ContentDialog1.SecondaryButtonText
source: Cancel
zh_cn: 取消

# PassphraseDialog_RememberSwitch.Header
source: Save on this device
zh_cn: 保存在本机

# PasteConfirmDialog_DontAskBox.Content
source: Do not ask again
zh_cn: 不再提示

# PermissionsDialog_OctalBox.Header
source: Octal
zh_cn: 八进制

# RenameDialog_NameBox.Header
source: Name
zh_cn: 名称

# ThemeSchemePickerDialog_ContentDialog1.Title
source: Choose a colour scheme to import
zh_cn: 选择要导入的配色

# ThemeSchemePickerDialog_ContentDialog1.PrimaryButtonText
source: Import selected
zh_cn: 导入所选

# ThemeSchemePickerDialog_ContentDialog1.SecondaryButtonText
source: Cancel
zh_cn: 取消

# SelectionLayer_CopyButton.Content
source: Copy
zh_cn: 复制

# SelectionLayer_PasteButton.Content
source: Paste
zh_cn: 粘贴

# SelectionLayer_SelectAllButton.Content
source: Select all
zh_cn: 全选

# SelectionLayer_ShareButton.Content
source: Share
zh_cn: 分享

# KnownHosts_Header.Title
source: Known hosts
zh_cn: 已知主机

# KnownHostsPage_SearchBox.PlaceholderText
source: Search host, type or fingerprint
zh_cn: 搜索主机、类型、指纹

# KnownHostsPage_Button1.Content
source: Delete
zh_cn: 删除

# SessionsPivot_Button1.Content
source: Restore all
zh_cn: 全部恢复

# SessionsPivot_Empty.Title
source: No open sessions
zh_cn: 没有打开的会话

# SessionsPivot_Empty.Description
source: Tap a host to connect.
zh_cn: 点主机开始连接。

# HostEdit_EnvKeyBox.PlaceholderText
source: KEY
zh_cn: 键

# HostEdit_EnvValueBox.PlaceholderText
source: VALUE
zh_cn: 值

# ColorSwatch_HexError
source: Colour must be in #RRGGBB form
zh_cn: 颜色须为 #RRGGBB 形式

# AgentUnlock_Prompt
source: Host {0}
zh_cn: 主机 {0}

# HostKey_FirstConnect
source: First connection to {0}
zh_cn: 首次连接 {0}

# HostKey_KeyType
source: Key type: {0}
zh_cn: 密钥类型：{0}

# HostKeyMismatch_ConfirmHint
source: Confirm removal by typing the host name {0}
zh_cn: 移除需确认：请输入主机名 {0}

# HostKeyMismatch_NameMismatch
source: Host name does not match; nothing was removed.
zh_cn: 主机名不匹配，未移除。

# KeyImport_SaveImport
source: Save import
zh_cn: 保存导入

# Passphrase_Prompt
source: Passphrase for private key {0}
zh_cn: 私钥 {0} 的短语

# PasteConfirm_Title
source: Paste multiple lines
zh_cn: 多行粘贴

# PasteConfirm_Paste
source: Paste
zh_cn: 粘贴

# PasteConfirm_Summary
source: Pasting {0} lines
zh_cn: 将粘贴 {0} 行

# SnippetVariable_Send
source: Send
zh_cn: 发送

# ThemeSchemePicker_Summary
source: Found {0} colour schemes in the file. Choose which to import:
zh_cn: 文件中找到 {0} 个配色，选择要导入的：

# Lifecycle_ExtendedExecution
source: Keeping SSH sessions alive in the background
zh_cn: SSH 会话后台保活

# AppearanceEdit_FontSize
source: Font size {0}
zh_cn: 字号 {0}

# AppearanceEdit_LineHeight
source: Line height {0}
zh_cn: 行高 {0}

# AppearanceEdit_Padding
source: Padding {0}
zh_cn: 内边距 {0}

# KeyDetail_NoPublicKeyToCopy
source: No public key to copy
zh_cn: 没有可复制的公钥

# KeyDetail_PublicKeyCopied
source: Public key copied
zh_cn: 已复制公钥

# KeyDetail_NoPublicKeyToShare
source: No public key to share
zh_cn: 没有可分享的公钥

# KeyDetail_ShareUnavailable
source: Sharing unavailable; public key copied
zh_cn: 分享不可用，已复制公钥

# KeyDetail_ShareFailed
source: Sharing failed; public key copied
zh_cn: 分享失败，已复制公钥

# SessionsPivot_Restore
source: {0} sessions left open last time
zh_cn: 上次未关闭 {0} 个会话

# ShortcutEditor_Conflict
source: Conflict: {0} is used by two actions
zh_cn: 冲突：{0} 被两个动作使用

# AccountSync_Title
source: Account and sync
zh_cn: 账号与同步

# ChangeLoginPassword_Explanation
source: You will need to sign in again after changing your password.
zh_cn: 修改密码后需要重新登录。

# SyncConflict_Title
source: Sync conflict
zh_cn: 同步冲突

# SyncConflict_Empty
source: No pending conflicts
zh_cn: 暂无待处理的冲突

# SyncConflict_UpdatedBoth
source: Cloud updated {0} · this device updated {1}
zh_cn: 云端更新于 {0} · 本机更新于 {1}

# SyncConflict_UpdatedRemote
source: Cloud updated {0}
zh_cn: 云端更新于 {0}

# KeyImport_Continue
source: Continue
zh_cn: 继续

# StatusDot_Connected
source: Connected
zh_cn: 已连接

# StatusDot_Connecting
source: Connecting
zh_cn: 连接中

# StatusDot_Reconnecting
source: Reconnecting
zh_cn: 重连中

# StatusDot_Error
source: Connection error
zh_cn: 连接错误

# StatusDot_Disconnected
source: Disconnected
zh_cn: 未连接

# KeyBar_Key_Esc
source: Escape key
zh_cn: Esc 键

# KeyBar_Key_Tab
source: Tab key
zh_cn: Tab 键

# KeyBar_Key_Ctrl
source: Control key
zh_cn: Ctrl 键

# KeyBar_Key_Alt
source: Alt key
zh_cn: Alt 键

# KeyBar_Key_Shift
source: Shift key
zh_cn: Shift 键

# KeyBar_Key_Up
source: Up arrow key
zh_cn: 向上方向键

# KeyBar_Key_Down
source: Down arrow key
zh_cn: 向下方向键

# KeyBar_Key_Left
source: Left arrow key
zh_cn: 向左方向键

# KeyBar_Key_Right
source: Right arrow key
zh_cn: 向右方向键

# KeyBar_Key_Home
source: Home key
zh_cn: Home 键

# KeyBar_Key_End
source: End key
zh_cn: End 键

# KeyBar_Key_PgUp
source: Page Up
zh_cn: 上一页

# KeyBar_Key_PgDn
source: Page Down
zh_cn: 下一页

# KeyBar_Key_Ins
source: Insert key
zh_cn: 插入键

# KeyBar_Key_Del
source: Delete key
zh_cn: 删除键

# KeyBar_Key_Enter
source: Enter key
zh_cn: 回车键

# KeyBar_Key_Backspace
source: Backspace key
zh_cn: 退格键

# KeyBar_Key_Paste
source: Paste
zh_cn: 粘贴

# KeyBar_Key_Copy
source: Copy
zh_cn: 复制

# KeyBar_Key_Snippets
source: Snippets
zh_cn: 代码片段

# KeyBar_Key_Pipe
source: Pipe
zh_cn: 管道符

# KeyBar_Key_Slash
source: Slash
zh_cn: 正斜杠

# KeyBar_Key_Backslash
source: Backslash
zh_cn: 反斜杠

# KeyBar_Key_Minus
source: Minus
zh_cn: 减号

# KeyBar_Key_Underscore
source: Underscore
zh_cn: 下划线

# KeyBar_Key_Tilde
source: Tilde
zh_cn: 波浪号

source: Enable sync
zh_cn: 启用同步

source: Auto sync
zh_cn: 自动同步

source: Sync passwords and passphrases
zh_cn: 同步密码与短语

source: Sync private keys
zh_cn: 同步私钥

source: Password
zh_cn: 密码

source: Private key passphrase
zh_cn: 私钥密码短语

source: Confirmation input
zh_cn: 确认输入框

source: Retry transfer
zh_cn: 重试传输

# Terminal_Canvas.[using:Windows.UI.Xaml.Automation]AutomationProperties.Name
source: Terminal output
zh_cn: 终端输出

# SessionState_Authenticating
source: Authenticating
zh_cn: 认证中

# SessionState_Disconnected
source: Disconnected
zh_cn: 已断开

# SessionState_Closed
source: Closed
zh_cn: 已关闭

# SessionState_None
source: Not connected
zh_cn: 未连接

# HostEdit_CredentialNew
source: New credential, applies after saving
zh_cn: 新凭据，保存后生效

# HostEdit_CredentialCleared
source: Saved credential will be cleared
zh_cn: 将清除已保存凭据

# HostEdit_CredentialSaved
source: Saved
zh_cn: 已保存

# ShortcutAction_NewTab
source: New tab
zh_cn: 新标签

# ShortcutAction_ClosePane
source: Close pane/tab
zh_cn: 关闭窗格/标签

# ShortcutAction_NextTab
source: Next tab
zh_cn: 下一个标签

# ShortcutAction_PrevTab
source: Previous tab
zh_cn: 上一个标签

# ShortcutAction_FocusLeft
source: Focus left pane
zh_cn: 聚焦左侧窗格

# ShortcutAction_FocusUp
source: Focus upper pane
zh_cn: 聚焦上方窗格

# ShortcutAction_FocusRight
source: Focus right pane
zh_cn: 聚焦右侧窗格

# ShortcutAction_FocusDown
source: Focus lower pane
zh_cn: 聚焦下方窗格

# ShortcutAction_Copy
source: Copy
zh_cn: 复制

# ShortcutAction_Paste
source: Paste
zh_cn: 粘贴

# ShortcutAction_FontIncrease
source: Increase font size
zh_cn: 字号增大

# ShortcutAction_FontDecrease
source: Decrease font size
zh_cn: 字号减小

# ShortcutAction_FontReset
source: Reset font size
zh_cn: 字号重置

# ShortcutAction_Find
source: Find
zh_cn: 查找

# Settings_LogPathNotFound
source: Can't find the log location, try again later
zh_cn: 找不到日志位置，请稍后重试

# Settings_LogListReadFailed
source: Reading the log list failed, try again later
zh_cn: 读取日志列表失败，请稍后重试

# Settings_LogNothingToExport
source: No logs to export
zh_cn: 没有可导出的日志

# Settings_ExportedCount
source: Exported {0} log files
zh_cn: 已导出 {0} 个日志文件

# Settings_ClearFailed
source: Clearing failed, try again later
zh_cn: 清空失败，请稍后重试

# Settings_ClearNone
source: No logs to clear
zh_cn: 没有可清空的日志

# Settings_Cleared
source: Logs cleared
zh_cn: 已清空日志

# Common_Unavailable
source: Unavailable
zh_cn: 不可用

# Settings_MemoryUsage
source: {0} MB used of {1} MB limit
zh_cn: 已用 {0} MB / 上限 {1} MB

source: Export cancelled
zh_cn: 已取消导出

# Export_OpenLocationFailed
source: Couldn't open the save location, retry or choose another folder
zh_cn: 无法打开保存位置，请重试或换个文件夹

# Export_WriteFailed
source: Couldn't write to the chosen location, close the program using the file and retry
zh_cn: 未能写入所选位置，请关闭占用该文件的程序后重试

# Export_Failed
source: Export failed, try again
zh_cn: 导出失败，请重试

# Validation_NameRequired
source: Name cannot be empty
zh_cn: 名称不能为空

source: Key not found
zh_cn: 密钥不存在

# Key_PrivateMissing
source: Private key missing (it may have been cleared); cannot export
zh_cn: 私钥不存在（可能已被清除），无法导出

# Key_Exported
source: Private key exported
zh_cn: 已导出私钥

# Snippet_VarHint
source: Use ${host} ${user} ${port} ${name}; any other ${xxx} is filled in when sent
zh_cn: 可用 ${host} ${user} ${port} ${name}，其他 ${xxx} 发送时填写

# Snippet_VarsPending
source: Variables to fill: {0}
zh_cn: 待填变量：{0}

# KeyBarEditor_FunctionKey
source: Function key {0}
zh_cn: 功能键 {0}

# KeyBarEditor_CharacterKey
source: Character key
zh_cn: 字符键

# KeyBarEditor_ModifierKey
source: Modifier key
zh_cn: 修饰键

# KeyBarEditor_QuickAction
source: Quick action
zh_cn: 快捷操作

# KeyBarEditor_CustomKey
source: Custom key
zh_cn: 自定义按键

# Common_Yes
source: Yes
zh_cn: 是

# Common_No
source: No
zh_cn: 否

# Settings_KeyBarSummary
source: {0} keys
zh_cn: {0} 个键

# Settings_ShortcutConflicts
source: {0} conflicts
zh_cn: {0} 处冲突

# Settings_ShortcutActions
source: {0} actions
zh_cn: {0} 个动作

# Snippet_EditNew
source: New snippet
zh_cn: 新建片段

# Snippet_EditExisting
source: Edit snippet
zh_cn: 编辑片段

# Tunnel_EditRouteLocal
source: Local {0}:{1} → {2} → {3}:{4}
zh_cn: 本机 {0}:{1} → {2} → {3}:{4}

# Tunnel_EditRouteRemote
source: {0} listens on :{1} → {2}:{3}
zh_cn: {0} 监听 :{1} → {2}:{3}

# Tunnel_EditRouteSocks
source: Local SOCKS5 proxy {0}:{1} → {2}
zh_cn: 本机 SOCKS5 代理 {0}:{1} → {2}

# Tunnel_EditTargetHost
source: Target host
zh_cn: 目标主机

# Tunnel_EditTargetServer
source: Target server
zh_cn: 目标服务器

# Common_Close
source: Close
zh_cn: 关闭

# Common_Delete
source: Delete
zh_cn: 删除

# Common_Export
source: Export
zh_cn: 导出

# Common_Continue
source: Continue
zh_cn: 继续

# Common_Available
source: Available
zh_cn: 可用

# KeyBar_Key_Colon
source: Colon
zh_cn: 冒号

# KeyBar_Key_Semicolon
source: Semicolon
zh_cn: 分号

# KeyBar_Key_SingleQuote
source: Single quote
zh_cn: 单引号

# KeyBar_Key_DoubleQuote
source: Double quote
zh_cn: 双引号

# KeyBar_Key_Backtick
source: Backtick
zh_cn: 反引号

# KeyBar_Key_LessThan
source: Less than
zh_cn: 小于号

# KeyBar_Key_GreaterThan
source: Greater than
zh_cn: 大于号

# KeyBar_Key_LeftBrace
source: Left brace
zh_cn: 左大括号

# KeyBar_Key_RightBrace
source: Right brace
zh_cn: 右大括号

# KeyBar_Key_LeftBracket
source: Left bracket
zh_cn: 左方括号

# KeyBar_Key_RightBracket
source: Right bracket
zh_cn: 右方括号

# KeyBar_Key_HideKeyboard
source: Hide keyboard
zh_cn: 隐藏键盘

# Settings_DiagAppVersion
source: App version:
zh_cn: 应用版本：

# Settings_DiagDeviceFamily
source: Device family:
zh_cn: 设备系列：

# Settings_DiagOsVersion
source: OS version:
zh_cn: 系统版本：

# Settings_DiagMemory
source: Memory:
zh_cn: 内存：

# Settings_LogFileType
source: Log files
zh_cn: 日志文件

# Settings_ProbeHaptics
source: Haptics
zh_cn: 触感

# Settings_ProbeStatusBar
source: Status bar
zh_cn: 状态栏

# Settings_ProbeKeepAlive
source: Background keep-alive
zh_cn: 后台保活

# Settings_ProbeDisplayRequest
source: Keep screen on
zh_cn: 屏幕常亮

# Settings_ProbeDeviceInfo
source: Device info
zh_cn: 设备信息

# Settings_ProbeMemory
source: Memory diagnostics
zh_cn: 内存诊断

# Settings_ProbeLogExport
source: Log export
zh_cn: 日志导出

# Settings_ProbeCredentialEncryption
source: Credential encryption
zh_cn: 凭据加密

# Settings_ProbeDeviceName
source: Device name
zh_cn: 设备名称

# Key_DeleteBlockedTitle
source: Can't delete key
zh_cn: 无法删除

# Key_DeleteBlockedMessage
source: This key is used by {0} host(s) ({1}). Change their authentication method first.
zh_cn: 该密钥正被 {0} 台主机使用（{1}），请先更换这些主机的认证方式。

# Key_DeleteConfirmTitle
source: Delete key?
zh_cn: 删除密钥？

# Key_DeleteConfirmMessage
source: Deleting "{0}" can't be undone. The saved private key and passphrase will be removed too.
zh_cn: 删除「{0}」后无法恢复，已保存的私钥与短语将一并清除。

# Key_UsedByHostsSuffix
source: · Used by {0} host(s)
zh_cn: · 被 {0} 台主机使用

# Key_ExportConfirmTitle
source: Export private key?
zh_cn: 导出私钥？

# Key_ExportConfirmMessage
source: The private key will be written in plaintext to the file you choose; any app that can read it can use it.
zh_cn: 私钥将以明文写入你选择的文件，任何能读到该文件的应用都能使用它。

# Key_ExportAgainTitle
source: Confirm again
zh_cn: 再次确认

# Key_ExportAgainMessage
source: Once the private key leaves the app it loses DPAPI protection. Make sure only you can access the destination.
zh_cn: 私钥一旦离开应用即失去 DPAPI 保护。请确认目标位置只有你能访问。

# Key_PrivatePemType
source: Private key file
zh_cn: 私钥文件

# Key_Saved
source: Saved
zh_cn: 已保存

# KeyImport_ExistsTitle
source: Key already exists
zh_cn: 密钥已存在

# KeyImport_ExistsMessage
source: A key with the same fingerprint already exists ("{0}"). Save it as a new key anyway?
zh_cn: 已存在相同指纹的密钥「{0}」。仍要保存为新密钥吗？

# KeyImport_SaveAnyway
source: Save anyway
zh_cn: 仍要保存

# KeyImport_ErrEncrypted
source: This private key is encrypted; enter the passphrase to continue
zh_cn: 该私钥已加密，请输入短语后继续

# KeyImport_ErrParse
source: Couldn't parse this private key (damaged file or wrong passphrase). Check and retry
zh_cn: 无法解析该私钥（文件损坏或短语错误），请检查后重试

# KeyImport_ErrTooLarge
source: File exceeds 256 KiB; import refused
zh_cn: 文件超过 256 KiB，拒绝导入

# KeyImport_ErrEmpty
source: Paste the private key content or import from a file
zh_cn: 请粘贴私钥内容或从文件导入

# KeyImport_TypeBits
source: {0} · {1} bits · {2}
zh_cn: {0} · {1} 位 · {2}

# KeyImport_SuffixEncrypted
source: · encrypted
zh_cn: · 已加密

# KeyImport_ErrPickFailed
source: File picker failed: {0}
zh_cn: 文件选择失败：{0}
